/*------------------------------------------------------------------------------
* Created (c) 2015 - Factory “KyivPrylad”
* 
* Permission to use, copy, modify, and distribute this software for any
* purpose with or without fee is hereby granted, provided that the above
* copyright notice and this permission notice appear in all copies.
* 
* THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
* WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
* MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
* ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
* WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
* ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
* OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
* 
*------------------------------------------------------------------------------
*
* Processor       : Lpc_3240
* File Name       : var_r_apcs_ici.h
* Description     : Variables exchange  on 
                    BR BR 
					  

*  Version        : 1.00
*
*       +----- (NEW | MODify | ADD | DELete)
*       |
*  No   |   When       Who                What
*-----+---+----------+------------------+--------------------------------------
* 000  NEW  26/01/15   Markovsky A       Creation
*----------------------------------------------------------------------------*/
#ifndef	VAR_R_APCS_ICI_H
#define	VAR_R_APCS_ICI_H



//``````````````````````````````````````````````````````````````````````````````````
//~~~  pvIn  - По данному адресу в случае успеха будут помещены     ~~~~~
//~~~    ~4  байта  данных                                         ~~~~~
//``````````````````````````````````````````````````````````````````````````````````
//~~~ uunsigned char  arUchLeds[(NUM_LED>>3)]               ~~~~~
//~~~ 	MSB ...LSB                                         ~~~~~
//~~~ 	CВ16 	CВ0                                         ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//---
extern long GetCurrSelectorPckpStpmStore(void *pv);
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//~~~     функция  чтения                                                      ~~~~~
//~~~     текущей группы уставок                                               ~~~~~
//~~~     возврат 3 - команда выполнена успешно                                ~~~~~
//~~~     возврат 4 - возникла  ошибка                                         ~~~~~
//~~~                                                    ~~~~~
//``````````````````````````````````````````````````````````````````````````````````
//``````````````````````````````````````````````````````````````````````````````````
//~~~  pv  - По данному адресу в случае успеха будет помещены     ~~~~~
//~~~    1  байт  данных                                         ~~~~~
//``````````````````````````````````````````````````````````````````````````````````
//~~~  char                 ~~~~~
//~~~ 	                                       ~~~~~
//~~~ 	                                        ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""


//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//~~~       Перечень констант   телемеханики        ~~~~~
//~~~                                                                          ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//``````````````````````````````````````````````````````````````````````````````````
#define NUM_IN  32
//~~~      - 
//``````````````````````````````````````````````````````````````````````````````````
#define NUM_OUT 16
//~~~      - 
//``````````````````````````````````````````````````````````````````````````````````
#define NUM_LED 16
//~~~      - 
//``````````````````````````````````````````````````````````````````````````````````


#define AMOUNT_BYTE_FOR_IN            (((NUM_IN)>>3) ) //+1) 

#define AMOUNT_BYTE_FOR_OUT           (((NUM_OUT)>>3)) // +1) 

typedef struct BrSetInOutDsc_TagIn
{
	char  chArIn    [AMOUNT_BYTE_FOR_IN ];
	char  chArOut   [AMOUNT_BYTE_FOR_OUT];
	
	char  chAr[4];//ID_Activator -  Who generate command or it may be Adress IEC
	//char  chArWrp[SIZE_WRP_];//
	
	
}BrSetInOutDsc;





typedef struct BrDateTimeDsc_TagIn
{

    char msec;     //00h 0.1 seconds 0.01 seconds 						Seconds 00-99
	char sec;      //01h ST 10 seconds  Seconds 						Seconds 00-59
    char min;      //02h 0 10 minutes   Minutes 						Minutes 00-59
    char hour;     //03h CB1 CB0 10 hours Hours (24-hour format) CB0, CB1 = Century bits/hours 0-3/00-23
	char dayweek;  //04h 0 0 0 0 0 Day of week 							Day 01-7
    char day;      //05h 0 0 10 date Date: 								day of month Date 01-31
    char month;    //06h 0 0 0 10M Month 								Month 01-12
    char year;     //07h 10 Years Year 									Year 00-99


}BrDateTime;

//ATRFG -activator func general possible another type activator


enum ENMAtrf_Out {
RESERV_000_ATRFG_ONB = 0,
RESERV_001_ATRFG_ONB,

HVSW_ON_DI_ATRFG_ONB                 ,// Вкл. ВВ от ДВ 
HVSW_OFF_DI_ATRFG_ONB                ,// Откл. ВВ 
CTRL_VKL_DI_ATRFG_ONB                ,// Контроль Вкл
CTRL_OTKL_DI_ATRFG_ONB               ,// Контроль Откл
RESET_SIGOUT_DI_ATRFG_ONB            ,// Сброс Реле	
RESET_LED_DI_ATRFG_ONB               ,// Сброс индикаци
BLOCK_SWITCHOVER_DI_ATRFG_ONB        ,// Блокировка включения ВВ
SWITCH_STATE_DI_ATRFG_ONB            ,// Положение ВВ (выключателя)
PERMIT_BLK_SW_MCP_DI_ATRFG_ONB       ,// Разблокировка включения ВВ


BLOCK_DSTP1_DI_ATRFG_ONB             ,// Блокировка Дист З1
BLOCK_DSTP2_DI_ATRFG_ONB             ,// Блокировка Дист З2
ACCLT_DSTP2_DI_ATRFG_ONB             ,//Оперативное ускорение Дист З2
ACCLT_DSTP2_EPI_ATRFG_ONB            ,//Телеускорение ускорение Дист З2 
